/*Задача 17*. Напишете стандартната програма за Linux wc, която приема
име на файл като аргумент от командния ред и изкарва на стандартния
изход стринга "Брой думи: ", последван от броя думи във файла.
Програмата да приема три вида аргументи:
 -c - който да изкарва "Брой символи: "
 -l - който да изкарва "Брой редове: "
 -w - който е за брой думи(тоест стандартното
поведение на програмата)
Ако е подаден поне един аргумент, да не се взема предвид стандартното
поведение.
 Примери:
> wc.exe f.c // изкарва броя думи
> wc -с t.c // изкарва броя символи
> wc -l t.txt // изкарва само броя редове
> wc -c -w main.c // изкарва броя символи и броя думи
във f1*/