/* Задача 6. Напишете структура с потребителски тип key_t, която съдържа
символен низ и число. Създайте променлива от новия тип, като
инициализирате символния низ с динамично заделена памет за него.
Принтирайте съдържанието на структурата*/
#include <stdio.h>

typedef struct{
    char string[20];
    int num;
}key_t;

int main(){
    key_t symbl;
    symbl.num = 200;
    printf("%d", symbl.num);
    



}