/*Задача 10 Напишете програма на C за отпечатване на естествени числа от 1 до 10 с помощта на
цикъл while.*/
#include <stdio.h>



int main(){


    int i = 1;
    while(i<=10){
        printf("%d\n",i++);

    }

    return 0;
}