/*Задача 19. За да стане голям един заек му е необходим един месец. След още един месец се ражда
още един заeк и така зайците стават 2. След още един месец първият заeк ражда още едно ново
зайче, а вторият е пораснал и така зайците са станали 3. След още един месец първите два заека
раждат по още един нов заек, а третият порасва и така нататък.
По този начин се получава известната редица на Фибоначи от числата 1, 1, 2, 3, 5, 8, 13, . . .
Характерното за тази редица е, че всяко следващо число от нея се получава като се сумират
предходните две числа. Да се напише програма, която чете едно цяло положително число n и
извежда n-тото число от тази редица*/

int main(){    
 int n1=0,n2=1,n3,i,number;    
 printf("Enter the number of elements:");    
 scanf("%d",&number);    
 printf("\n%d %d",n1,n2);//printing 0 and 1    
 for(i=2;i<number;++i)//loop starts from 2 because 0 and 1 are already printed    
 {    
  n3=n1+n2;    
  printf(" %d",n3);    
  n1=n2;    
  n2=n3;    
 }  
  return 0;  
 }