/*
Задача 20. Да се напише програма, която намира произведението на всички нечетни числа,
които са по-малки от n. Числото n се задава на вход.
 */

// Това е безкраен цикъл та поради тази причина ще добавя условие на числата по големи от
// 0


int main(){

int iNum= 0;
printf("Enter number n: ");
scanf("%d",&iNum);
for(iNum;iNum > 0;iNum--){
printf("%d",iNum);
}
}