#include <stdio.h>
/*2.Напишете програма, която копира един масив в друг, използвайки указатели.
3.Напишете програма, която разменя елементите на два еднакви по размер масива, използвайки указатели.
4.Напишете програма, която обръща местата на елементите в един масив, използвайки указатели.
5.Напишете програма за търсене на определен елемент в даден масив, използвайки указатели.

*/

int main(){
    int arr[3]={2,4,5};
    int arrCopy[3]={};
    int* p= arr;
    int* pLast = p+3;
    int* sPointer=arrCopy;
int i=0;
    for(* p,i=0;p<pLast;i++){
        *sPointer = *p;
        printf("%d ",arrCopy[i]);

        sPointer++;
                p++;
        
    }
    

    
    return 0 ;
}