/*Задача 10. Напишете програма на С, която съдържа 3 функции, изнесете
прототипите им в отделен .h файл.
1. Първата функция да калкулира най-малко общо кратно на две положителни
числа.
2. Втората функция връща абсолютна стойност на числата (положителната
стойност на числата).
a. Трябва да може да приеме като параметър float и да върне float.
b. Тествайте с инт и float.
3. Напишете функция, която калкулира корен квадратен от число.
a. Проверете дали резултатът е отрицателно число и върнете -1.
b. Използвайте втората си функция, за да обърнете числото в положително и да
намерите корен квадратен от него.*/
#include <stdio.h>
#include "for10.h"

int  iSubMultiple1(int a ,int b );
float  iABS2(float num);
int iCheck3(int a);

int main(){
int a,b;
printf("Enter numbers ");
scanf("%d %d ", &a,&b);
int swap;
    swap =iSubMultiple1(a,b);
    float test;
    printf("Enter value ;");
    scanf("%f",&test);
    iABS2(test);
    int iforCheck;
    iforCheck = iCheck3(swap);
    return 0;
}