/*Задача 10. Напишете програма на С, която съдържа 3 функции, изнесете
прототипите им в отделен .h файл.
1. Първата функция да калкулира най-малко общо кратно на две положителни
числа.
2. Втората функция връща абсолютна стойност на числата (положителната
стойност на числата).
a. Трябва да може да приеме като параметър float и да върне float.
b. Тествайте с инт и float.
3. Напишете функция, която калкулира корен квадратен от число.
a. Проверете дали резултатът е отрицателно число и върнете -1.
b. Използвайте втората си функция, за да обърнете числото в положително и да
намерите корен квадратен от него.*/
#include<stdio.h>
#include<math.h> //to be compiled with -lm flag 



int  iSubMultiple1(int a ,int b ){
    int iChek= 0;
    for(int i=1;i<=a;i++){
        for(int j=1;j<=b;j++){
            if(i%j == 0 ){
                printf("%d %d");
                iChek ++;
                break;
                }
        }
    if(iChek  == 0){
        break;
        }
    }

}
/*2. Втората функция връща абсолютна стойност на числата (положителната
стойност на числата).
a. Трябва да може да приеме като параметър float и да върне float.
b. Тествайте с инт и float.*/

float  iABS2(float num){
    double temp ;
    temp =fabs(num);
    return (float)temp;
    
}
/*3. Напишете функция, която калкулира корен квадратен от число.
a. Проверете дали резултатът е отрицателно число и върнете -1.
b. Използвайте втората си функция, за да обърнете числото в положително и да
намерите корен квадратен от него.*/

int iCheck3(int a){
    int temp;
    int temp=a;
    if(temp < 0){
        return  -1;
    }
    temp =iABS2((int) a);
    temp = sqrt(a);
    printf("%d \n",temp);
}

