/*
1.За да променим n тия bit на променливата а на 1 трябва да
използваме побитово ИЛИ
int a = 15; в двоичен вид това е числото 0000 1111
Ако искаме да сетнем нулата на пета позиция правим маска 0010
0000, като шифтнем 1 << 5; пъти. След това прилагаме побитово
ИЛИ на променливата и маската:
0000 1111
|
0010 0000
= 0010 1111
*/

#include <stdio.h>

int main(){


    long  int acumolator[1] = {1};

    for (int i = 0; i < 100; i++)
    {
        printf("%lld\n", xorRand(acumolator));
    }

    return 0;

}