/*Напишете програма, която запълва масив от 20 елемента с
произволно избрани цели числа. За целта използвайте
функцията rand(). Въведете едно цяло число от
клавиатурата. Проверете дали въведеното число от
клавиатурата е намерено в масива. Принтирайте масива и
отговора дали числото е намерено в масива.*/

#include<stdio.h>
#include<time.h>
#include <stdlib.h>

int main()
{

    int iCheck;
    int array[20]={};
    scanf("%d",&iCheck);
    


    for(int i=0;i<20;i++)
    {   array[i]= (rand() % 70) +1;
        //printf("%d \n",array[i]);
    }
    int flag = 0;
    for(int j = 0;j<20;j++){
        if(iCheck == array[j]){

        }
    }

    return 0;
}
